; domain
(define (domain ferry)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l5-c4)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 
          c0 c1 c2 c3 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(car c0)
(car c1)
(car c2)
(car c3)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(empty-ferry)
(at c0 l2)
(at c1 l3)
(at c2 l0)
(at c3 l1)
(at-ferry l1)
)
(:goal
(and
(at c0 l4)
(at c1 l1)
(at c2 l3)
(at c3 l2)
)
)

(:constraints
  (and
    (sometime-before  (at c0 l4) (at-ferry l0))
    (sometime-before  (at c1 l1) (at-ferry l0))
    (sometime-before  (at c2 l3) (at-ferry l2))
    (sometime-before  (at c3 l2) (at-ferry l0))
  )
)
)

; plan
1. (board c3 l1)
   deleted: (at c3 l1) (empty-ferry)
   added: (on c3)
   goals met: 0 of 4
2. (sail l1 l2)
   deleted: (at-ferry l1)
   added: (at-ferry l2)
   goals met: 0 of 4
3. (sail l2 l0)
   deleted: (at-ferry l2)
   added: (at-ferry l0)
   goals met: 0 of 4
4. (debark c3 l0)
   deleted: (on c3)
   added: (at c3 l0) (empty-ferry)
   goals met: 0 of 4
5. (board c2 l0)
   deleted: (at c2 l0) (empty-ferry)
   added: (on c2)
   goals met: 0 of 4
6. (sail l0 l3)
   deleted: (at-ferry l0)
   added: (at-ferry l3)
   goals met: 0 of 4
7. (debark c2 l3)
   deleted: (on c2)
   added: (at c2 l3) (empty-ferry)
   goals met: 1 of 4
8. (board c1 l3)
   deleted: (at c1 l3) (empty-ferry)
   added: (on c1)
   goals met: 1 of 4
9. (sail l3 l4)
   deleted: (at-ferry l3)
   added: (at-ferry l4)
   goals met: 1 of 4
10. (sail l4 l1)
   deleted: (at-ferry l4)
   added: (at-ferry l1)
   goals met: 1 of 4
11. (debark c1 l1)
   deleted: (on c1)
   added: (at c1 l1) (empty-ferry)
   goals met: 2 of 4
12. (sail l1 l4)
   deleted: (at-ferry l1)
   added: (at-ferry l4)
   goals met: 2 of 4
13. (sail l4 l2)
   deleted: (at-ferry l4)
   added: (at-ferry l2)
   goals met: 2 of 4
14. (board c0 l2)
   deleted: (at c0 l2) (empty-ferry)
   added: (on c0)
   goals met: 2 of 4
15. (sail l2 l4)
   deleted: (at-ferry l2)
   added: (at-ferry l4)
   goals met: 2 of 4
16. (debark c0 l4)
   deleted: (on c0)
   added: (at c0 l4) (empty-ferry)
   goals met: 3 of 4
17. (sail l4 l2)
   deleted: (at-ferry l4)
   added: (at-ferry l2)
   goals met: 3 of 4
18. (sail l2 l0)
   deleted: (at-ferry l2)
   added: (at-ferry l0)
   goals met: 3 of 4
19. (board c3 l0)
   deleted: (at c3 l0) (empty-ferry)
   added: (on c3)
   goals met: 3 of 4
20. (sail l0 l2)
   deleted: (at-ferry l0)
   added: (at-ferry l2)
   goals met: 3 of 4
21. (debark c3 l2)
   deleted: (on c3)
   added: (at c3 l2) (empty-ferry)
   goals met: 4 of 4
